name: "resnet_trt_int8"
platform: "tensorrt_plan"
max_batch_size: 128

input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [ 3, 32, 32 ]
  }
]
output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [ 10 ]
  }
]

# Dynamic Batching 활성화 (ONNX 설정과 동일하게 유지)
dynamic_batching {
  preferred_batch_size: [ 4, 8, 16, 32, 64 ]
  max_queue_delay_microseconds: 100
}

# GPU 인스턴스 설정
instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]